       01  EmployeeDetails.
       88  EndOfEmployeeFile   VALUE HIGH-VALUES.
       03    EmpSSN              PIC 9(9).
       03    EmpName.
       05      EmpSurname        PIC X(15).
       05      EmpForename       PIC X(10).
       03    EmpDateOfBirth.
       05      EmpYOB            PIC 9(4).
       05      EmpMOB            PIC 99.
       05      EmpDOB            PIC 99.
       03    EmpGender           PIC X.

